

list1 = ["Python", "Java", "C++"]

# فقط مرجع کپی می‌شود.
list2 = list1

print("آدرس list1 :", id(list1))
print("آدرس list2 :", id(list2))

list2.append("C#")

print("list1 =", list1)
print("list2 =", list2)

"""
پاسخ سوالات

1- آیا لیست اول تغییر کرده است؟
بله.

2- چرا هر دو لیست تغییر کرده‌اند؟
چون هر دو متغیر به یک شیء در حافظه اشاره می‌کنند.

3- آیا این دو متغیر به دو شیء متفاوت اشاره می‌کنند؟
خیر.
آدرس هر دو یکسان است.
"""


list1 = ["Python", "Java", "C++"]

# این بار یک کپی مستقل ساخته می‌شود.
list2 = list1.copy()

print("آدرس list1 :", id(list1))
print("آدرس list2 :", id(list2))

list2.append("C#")

print("list1 =", list1)
print("list2 =", list2)

"""
نتیجه

در این حالت فقط لیست دوم تغییر می‌کند.
زیرا یک شیء جدید در حافظه ساخته شده است.
"""


x = 100
y = x

print("id(x) =", id(x))
print("id(y) =", id(y))

y = 200

print("x =", x)
print("y =", y)

print("id(x) =", id(x))
print("id(y) =", id(y))

"""
پاسخ سوال

چرا مقدار متغیر اول تغییر نکرد؟

چون عددها در پایتون تغییرناپذیر هستند.

با تغییر مقدار متغیر دوم،
یک شیء جدید در حافظه ساخته می‌شود
و فقط متغیر دوم به آن اشاره می‌کند.
"""

"""
متغیر

نامی است که به یک شیء در حافظه اشاره می‌کند.

شیء

داده‌ای است که در حافظه ذخیره می‌شود.

تفاوت روش اول و روش دوم

روش اول
"""

print("list2 = list1")

"""
فقط مرجع کپی می‌شود.
هر دو متغیر به یک شیء اشاره می‌کنند.

روش دوم
"""

print("list2 = list1.copy()")

"""
یک شیء جدید ساخته می‌شود.
تغییرات لیست دوم روی لیست اول اثری ندارد.

چرا لیست و عدد رفتار متفاوتی دارند؟

لیست‌ها تغییرپذیر هستند.

عددها تغییرناپذیر هستند.
با تغییر مقدار، یک شیء جدید ساخته می‌شود.
"""